In [1]:
import pandas as pd

In [2]:
account_info = pd.DataFrame({
    'name': ["Bob", 'Mary', 'Mita'],
    'account': [123846, 123972, 347209],
    'balance': [123, 3972, 7209]
})

In [4]:
account_info.iloc[1,2]

3972

In [5]:
account_info.iloc[1]

name         Mary
account    123972
balance      3972
Name: 1, dtype: object

In [6]:
account_info.iloc[1, 2] = 3975

In [7]:
account_info.iloc[1,2]

3975

In [8]:
account_info.iloc[1]

name         Mary
account    123972
balance      3975
Name: 1, dtype: object

In [9]:
account_info.iloc[:, [0, 2]]

   name  balance
0   Bob      123
1  Mary     3975
2  Mita     7209

In [10]:
account_info.iloc[:, [1, 2]]

   account  balance
0   123846      123
1   123972     3975
2   347209     7209